print('Перезагрузите компьютер и попробуйте подключиться')
print('Исправили проблему?')
x=str(input('Введите yes или no при ответе на вопросы '))

if x=='yes':
    print('Решение проблемы найдено')
elif x=='no':
    print('Перезагрузите маршрутизатор и попробуйте подключиться')
    print('Исправили проблему? ')
elif x=='yes':
     print('Решение проблемы найдено')
elif x='no':
     print('Убедитесь, что кабели между маршрутизатором и модемом прочно подсоединены')
     print('Исправили проблему? ')
elif x=='yes':
     print('Решение проблемы найдено')
       else:
          print('Переместите маршрутизатор на новое место')
          print('Исправили проблему? ')
          if x=='yes':
             print('Решение проблемы найдено')
          else:
             print('Возьмите новый маршрутизатор')




